{
  "backend/main.mo": "Actor defines products, orders, and user profile management with access‑controlled admin and user APIs plus shop initialization with preset products.",
  "feature_evidence.json": "Feature evidence report listing image‑resolution and URL‑encoding improvements along with affected frontend files and related metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files across components, pages, APIs, and styles.",
  "frontend/index.css": "Global Tailwind base and CSS variables defining light/dark theme color tokens and shared UI styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/api/adminProductHooks.ts": "React Query hooks for admin product CRUD and publish operations with cache invalidation.",
  "frontend/src/api/authHooks.ts": "Hook checking whether the caller is an admin using actor and identity state.",
  "frontend/src/api/queryKeys.ts": "Centralized React Query key generator for products, orders, and admin checks.",
  "frontend/src/api/shopHooks.ts": "React Query hooks for fetching products, creating orders, and initializing the shop.",
  "frontend/src/App.tsx": "Main app routing setup with TanStack Router and layout wrapped in the CartProvider.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Order summary component rendering item totals and subtotal in INR format.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Access‑denied UI with icon, admin‑only messaging, and button to return home.",
  "frontend/src/components/feedback/AsyncState.tsx": "Provides a component to display loading skeletons, error alerts with retry, empty states, or children content; includes a simple loading spinner.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with brand info, quick links, contact text, and a dynamic year footer.",
  "frontend/src/components/layout/SiteHeader.tsx": "Implements the site header with navigation links, cart button, mobile menu, and conditional admin link.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product card with image fallback, details, price, stock, and add-to-cart button.",
  "frontend/src/components/products/ProductDescription.tsx": "Parses a description into lines, formatting key-value pairs and regular text for display.",
  "frontend/src/components/products/ProductGrid.tsx": "Shows a grid of ProductCard components or an empty message when no products exist.",
  "frontend/src/components/products/ProductImageGallery.tsx": "Shows a product image gallery with thumbnails and a fallback placeholder when images are missing or fail.",
  "frontend/src/components/products/ProductSearchBar.tsx": "Provides a search input and category selector for filtering products.",
  "frontend/src/content/siteContent.ts": "Defines the structure and text content configuration used across the site's UI.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state, login/logout, and status flags.",
  "frontend/src/index.css": "Defines Tailwind base layers and custom CSS variables for light/dark themes plus global styles and a custom container class.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider, and mounts it to the DOM.",
  "frontend/src/pages/AboutContactPage.tsx": "Renders the About and Contact sections using site content, including a credit footer and a styled contact card.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin interface for listing, creating, editing, and publishing products with identity-based admin checks and product management dialogs.",
  "frontend/src/pages/CartPage.tsx": "Displays cart contents with quantity controls, removal actions, and an order summary, handling the empty cart state.",
  "frontend/src/pages/CategoryPage.tsx": "Loads and displays products for a given category with loading/error handling and a product grid.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles the checkout flow including form validation, order creation, success state display, and cart clearing.",
  "frontend/src/pages/HomePage.tsx": "Home page that initializes shop data, highlights featured products, and renders hero, categories, and product sections.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail view that loads a product, shows gallery and info, and supports adding items to the cart.",
  "frontend/src/pages/ShopPage.tsx": "Shop listing page that fetches products, filters by search and category, and displays them in a grid.",
  "frontend/src/store/cart.ts": "Pure cart utilities handling storage, item add/remove/update, subtotal calculation, and persistence.",
  "frontend/src/store/CartProvider.tsx": "React context provider managing cart state, persistence, and utility actions like add, remove, and update.",
  "frontend/src/utils/currency.ts": "Utility to format numeric values as INR currency strings.",
  "frontend/src/utils/productImages.ts": "Image lookup utility mapping product IDs to image arrays with URL-safe encoding helpers.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended color system using CSS variables, custom animations, typography, container queries, and animation plugins.",
  "project_state.json": "Defines current project state, including summary, architecture notes, known issues, feature list, and version metadata for the website build."
}