{
  "backend/main.mo": "Motoko canister implementing products, orders, user profiles, and access-controlled admin/user APIs with initial shop setup.",
  "feature_evidence.json": "Feature evidence report mapping two error-handling features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files including global styles, routing, UI components, and shop logic.",
  "frontend/index.css": "Tailwind-based global styling defining OKLCH color tokens and dark mode variables for the theme system.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/api/adminProductHooks.ts": "React Query hooks for admin product CRUD operations with cache invalidation.",
  "frontend/src/api/authHooks.ts": "Fetches admin status using actor identity with React Query.",
  "frontend/src/api/queryKeys.ts": "Defines centralized query keys for products, orders, and admin checks.",
  "frontend/src/api/shopHooks.ts": "React Query hooks for public product browsing and order creation with storefront error sanitization.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in CartProvider with shared layout.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Displays cart line items and subtotal formatted in INR with a summary layout.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "User-facing access denied view for restricted admin-only routes with navigation button.",
  "frontend/src/components/feedback/AsyncState.tsx": "Provides a component for handling loading, error, and empty states with optional retry and skeletons.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with brand info, quick links, contact text, and a dynamic copyright.",
  "frontend/src/components/layout/SiteHeader.tsx": "Displays the main header with navigation, cart, mobile menu, and conditional admin link.",
  "frontend/src/components/products/ProductCard.tsx": "Shows a product card with image handling, price, stock info, and add-to-cart functionality.",
  "frontend/src/components/products/ProductDescription.tsx": "Formats product description text into paragraphs or key-value rows.",
  "frontend/src/components/products/ProductGrid.tsx": "Renders a responsive grid of ProductCard components or a fallback when empty.",
  "frontend/src/components/products/ProductImageGallery.tsx": "Provides a main image viewer with thumbnails and fallback handling for failed images.",
  "frontend/src/components/products/ProductSearchBar.tsx": "Offers a search input and category selector for filtering products.",
  "frontend/src/content/siteContent.ts": "Defines a centralized config object and interface for all site marketing copy, navigation labels, and page text.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, stored identity loading, and status tracking.",
  "frontend/src/index.css": "Configures Tailwind layers and theme CSS variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutContactPage.tsx": "Renders the About and Contact sections using site content with styled layout and contact card.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin interface for listing, creating, editing, and publishing products with identity and access checks.",
  "frontend/src/pages/CartPage.tsx": "Displays cart contents, quantity controls, and an empty‑state message using cart context.",
  "frontend/src/pages/CategoryPage.tsx": "Displays products for a selected category using a grid and handles loading, errors, and empty states.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements checkout flow with form validation, order submission, success screen, and cart clearing.",
  "frontend/src/pages/HomePage.tsx": "Renders homepage with hero content, featured products logic, and admin-aware empty state handling.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product info, image gallery, stock status, and supports adding items to the cart.",
  "frontend/src/pages/ShopPage.tsx": "Provides product browsing with category filtering, search, and state-managed product loading.",
  "frontend/src/store/cart.ts": "Defines cart state structure and utility functions for modifying and persisting the cart.",
  "frontend/src/store/CartProvider.tsx": "React context wrapper managing cart state, persistence, and update utilities.",
  "frontend/src/utils/currency.ts": "Utility for formatting numeric values as INR currency strings.",
  "frontend/src/utils/productImages.ts": "Maps product IDs to image filenames and builds base-path-aware URLs, providing utilities to fetch full image lists or the primary image.",
  "frontend/src/utils/storefrontErrorSanitizer.ts": "Detects replica and stopped-canister errors and converts them into simplified user-friendly messages, with a wrapper to auto-sanitize async calls.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash/query-based routing values.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, animations, and loads typography, container queries, and animation plugins.",
  "project_state.json": "Captures the project's state, issues, features, and deployment notes for The Lens storefront, including ongoing image and backend errors."
}