{
  "backend/main.mo": "Motoko canister implementing products, orders, user profiles with phone verification, and access control.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files for reference.",
  "frontend/index.css": "Tailwind base styles with custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Root HTML document mounting the React app via main.tsx.",
  "frontend/src/api/adminProductHooks.ts": "React Query hooks for admin product CRUD and publish status with cache invalidation.",
  "frontend/src/api/authHooks.ts": "React Query hook to check if the caller is an admin.",
  "frontend/src/api/phoneVerificationHooks.ts": "Hooks for requesting, verifying, and checking phone verification with sanitized errors.",
  "frontend/src/api/queryKeys.ts": "Centralized React Query key definitions for products, orders, admin, profiles, and verification.",
  "frontend/src/api/shopHooks.ts": "Storefront hooks for fetching products, creating orders, and initializing the shop with sanitized errors.",
  "frontend/src/api/userProfileHooks.ts": "Provides React Query hooks to fetch and save the caller's user profile with authentication checks and error sanitization.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in CartProvider with shared layout.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Displays a list of cart items with prices and shows the subtotal for checkout.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Renders an access denied message with an icon and a button to return home.",
  "frontend/src/components/feedback/AsyncState.tsx": "Handles loading, error, and empty UI states with sanitization for errors and optional retry logic.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with brand info, quick links, contact details, and attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Displays the site header with navigation, cart button, mobile menu, and optional admin link.",
  "frontend/src/components/products/ProductCard.tsx": "Shows a product card with image handling, details, price, stock, and add‑to‑cart functionality.",
  "frontend/src/components/products/ProductDescription.tsx": "Formats a product description into key‑value lines or paragraphs for display.",
  "frontend/src/components/products/ProductGrid.tsx": "Displays a responsive grid of product cards or an empty state.",
  "frontend/src/components/products/ProductImageGallery.tsx": "Provides an image gallery with error handling, thumbnail selection, and fallbacks for missing images.",
  "frontend/src/components/products/ProductSearchBar.tsx": "Search bar component with text input and category filter using Select UI elements.",
  "frontend/src/content/siteContent.ts": "Central config defining site marketing copy, navigation labels, and static content types.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, refetching on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login state, stored identities, and auth client setup.",
  "frontend/src/index.css": "Tailwind CSS setup defining color variables, light/dark themes, and base styles.",
  "frontend/src/main.tsx": "App entry that mounts React, sets up React Query and Internet Identity provider.",
  "frontend/src/pages/AboutContactPage.tsx": "Renders About and Contact sections using site content with styled cards and attribution.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin interface to view, create, edit, and publish products with dialogs, forms, and permission checks.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart, allowing item quantity updates, removal, and navigation to checkout or shop.",
  "frontend/src/pages/CategoryPage.tsx": "Fetches and shows products for a given category with loading, error, and empty states.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow including form validation, order creation, and success confirmation.",
  "frontend/src/pages/HomePage.tsx": "Shows the homepage with hero content, featured products, and admin-aware empty states.",
  "frontend/src/pages/LoginPage.tsx": "Manages user login via Internet Identity, phone verification, form validation, and OTP flow.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays product details, stock info, images, and allows adding items to the cart.",
  "frontend/src/pages/ShopPage.tsx": "Lists all products with category and search filtering plus loading/error handling.",
  "frontend/src/store/cart.ts": "Implements cart state operations and persistence, including add, remove, update, clear, and subtotal/count utilities.",
  "frontend/src/store/CartProvider.tsx": "Provides a React context for cart state, syncing with storage and exposing cart operations and totals.",
  "frontend/src/utils/authFlowErrorSanitizer.ts": "Converts authentication-related errors into friendly messages by detecting common patterns and cleaning technical details.",
  "frontend/src/utils/currency.ts": "Formats numbers as INR currency strings using Intl.NumberFormat.",
  "frontend/src/utils/productImages.ts": "Maps product IDs to image filenames and builds base-path-aware URLs for product images in production.",
  "frontend/src/utils/storefrontErrorSanitizer.ts": "Sanitizes storefront errors by detecting canister, actor, replica, and backend trap errors and returning friendly messages.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session-based parameters, including hash-route support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Tracks project version, high-level goals, architecture notes, known deployment and image-loading issues, and a list of implemented storefront features. Indicates ongoing fix requests related to product visibility, canister errors, and image rendering failures across deployments."
}