{
  "backend/main.mo": "Defines product, order, and user-profile types with access control, manages state maps, and provides APIs for profiles, shop initialization, and product/order operations.",
  "feature_evidence.json": "Feature evidence report describing a requirement to ensure the CMF earbuds product remains published across deployments and upgrades.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base layer defining CSS variables for light and dark themes using a warm OKLCH palette.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/api/adminProductHooks.ts": "React Query hooks for admin product CRUD and publish status updates with cache invalidation.",
  "frontend/src/api/authHooks.ts": "Provides a React Query hook to check if the current caller is an admin.",
  "frontend/src/api/queryKeys.ts": "Centralized query key definitions for products, orders, and admin APIs.",
  "frontend/src/api/shopHooks.ts": "React Query hooks for storefront product fetching, order creation, and shop initialization.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and global layout, wrapping all pages in a CartProvider.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Renders an order summary showing line items and subtotal formatted in INR.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Access‑denied UI with an admin‑only warning and a button to return home.",
  "frontend/src/components/feedback/AsyncState.tsx": "Provides a wrapper for loading, error, empty, and content states with optional retry and a loading spinner component.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer using centralized content, including brand info, quick links, contact text, and attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Builds the site header with navigation, cart button, mobile menu, branding, and optional admin link.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product card with image, name, description, price, stock, and an add‑to‑cart button.",
  "frontend/src/components/products/ProductDescription.tsx": "Formats a product description into paragraphs and key‑value rows by splitting lines.",
  "frontend/src/components/products/ProductGrid.tsx": "Shows a responsive grid of ProductCard components or an empty message if no products exist.",
  "frontend/src/components/products/ProductImageGallery.tsx": "Renders a main product image with selectable thumbnails and a fallback placeholder on errors.",
  "frontend/src/components/products/ProductSearchBar.tsx": "Provides a search input and category selector for filtering products.",
  "frontend/src/content/siteContent.ts": "Defines centralized editable site content and its structure for branding, navigation, and page text.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling login, stored identity loading, and status management.",
  "frontend/src/index.css": "Defines Tailwind CSS base layers and theme variables for light and dark modes with custom container styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering.",
  "frontend/src/pages/AboutContactPage.tsx": "Renders About and Contact sections using site content, including credits and an email card.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin interface for viewing, creating, editing, and publishing products with identity and admin checks.",
  "frontend/src/pages/CartPage.tsx": "Displays the shopping cart with item management, quantity updates, and empty-cart handling.",
  "frontend/src/pages/CategoryPage.tsx": "Fetches and displays products for a selected category with loading, error, and empty states.",
  "frontend/src/pages/CheckoutPage.tsx": "Manages checkout flow with form validation, order creation, and success confirmation.",
  "frontend/src/pages/HomePage.tsx": "Home page that loads products, initializes the shop if empty, highlights featured items, and renders hero, categories, and product sections.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail view fetching a single product, showing gallery, details, stock, quantity input, and add‑to‑cart logic.",
  "frontend/src/pages/ShopPage.tsx": "Shop listing page that filters products by category and search query and displays them with loading and empty states.",
  "frontend/src/store/cart.ts": "Pure cart utilities for loading, saving, and mutating cart items plus calculating subtotal and item count.",
  "frontend/src/store/CartProvider.tsx": "React context provider managing cart state with add, remove, update, clear, subtotal, and item count, persisted via localStorage.",
  "frontend/src/utils/currency.ts": "Utility for formatting numbers as INR currency using Intl.NumberFormat.",
  "frontend/src/utils/productImages.ts": "Maps product IDs to image arrays and provides helpers to retrieve all or primary images.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL and session parameters, including hash-based handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "JSON describing project state, including versioning, features, architectural notes, known issues, and storefront requirements for The Lens website. It defines existing features, metadata, and configuration for build planning."
}