{
  "backend/main.mo": "Motoko canister defining products, orders, user profiles, phone verification, and access-controlled APIs with persistent state maps.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten frontend file summaries covering styling, routing, components, APIs, error handling, and product image logic.",
  "frontend/index.css": "Tailwind base styles defining custom OKLCH color tokens, dark mode variables, and global background/foreground rules.",
  "frontend/index.html": "Basic HTML shell loading the React app root and main TypeScript entry point.",
  "frontend/src/api/adminProductHooks.ts": "React Query hooks for admin product CRUD operations with query invalidation and actor-availability checks.",
  "frontend/src/api/authHooks.ts": "Hook to check whether the current authenticated caller is an admin using React Query and actor state.",
  "frontend/src/api/phoneVerificationHooks.ts": "React Query mutations and queries for requesting and verifying phone codes with sanitization and identity checks.",
  "frontend/src/api/queryKeys.ts": "Centralized React Query key definitions for products, orders, admin, user profiles, and phone verification.",
  "frontend/src/api/shopHooks.ts": "Provides React Query hooks for fetching products, creating orders, and initializing the shop using an actor with error sanitization and cache invalidation.",
  "frontend/src/api/userProfileHooks.ts": "Defines hooks to fetch and update the caller's user profile with authentication checks and query invalidation.",
  "frontend/src/App.tsx": "Root React router configuration with layout and routes for storefront, admin, auth, and checkout, wrapped in CartProvider.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Renders a summary of cart items with prices and subtotal for checkout.",
  "frontend/src/components/feedback/AccessDeniedScreen.tsx": "Displays an access denied message with navigation back to the home page.",
  "frontend/src/components/feedback/AsyncState.tsx": "Handles loading, error, and empty UI states with optional retry and a sanitized error display.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with brand info, links, contact text, and attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Renders the site header with navigation, cart button, branding, and optional admin link.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product card with images, description, price, stock, and add-to-cart functionality.",
  "frontend/src/components/products/ProductDescription.tsx": "Parses and displays product descriptions line by line, supporting key-value formatting.",
  "frontend/src/components/products/ProductGrid.tsx": "Displays a responsive grid of product cards or a fallback when no products are available.",
  "frontend/src/components/products/ProductImageGallery.tsx": "Displays a product image gallery with fallback handling and thumbnail navigation, using product ID or name to load images.",
  "frontend/src/components/products/ProductSearchBar.tsx": "Provides a search input and category filter UI for product lists.",
  "frontend/src/content/siteContent.ts": "Defines the site-wide content configuration interface and documentation for all editable marketing copy.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider for authentication, handling login, logout, and identity loading.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables, dark mode styles, and base utility layers.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutContactPage.tsx": "Renders About and Contact sections using site content, including marketing text and contact details.",
  "frontend/src/pages/AdminProductsPage.tsx": "Admin interface for listing, creating, editing, and publishing products with dialogs and validation. Handles admin auth, product form state, and CRUD actions via hooks.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items with quantity controls and removal options. Shows empty state and provides order subtotal and navigation to checkout.",
  "frontend/src/pages/CategoryPage.tsx": "Fetches and displays products for a specific category using a grid layout. Includes loading, error, and empty states.",
  "frontend/src/pages/CheckoutPage.tsx": "Collects shipping details and submits orders, clearing the cart on success. Shows order confirmation with reference ID after completion.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero content and featured products with admin-aware empty states. Pulls products and supports shop initialization for admins.",
  "frontend/src/pages/LoginPage.tsx": "Handles user login with phone-based OTP verification and profile creation. Manages multi-step form, validation, resend cooldowns, and authentication state.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays a product’s details, images, stock, and allows adding the product to the cart with quantity control.",
  "frontend/src/pages/ShopPage.tsx": "Fetches and filters all products by category and search query, rendering them in a grid with loading and error states.",
  "frontend/src/store/cart.ts": "Implements cart state operations including load/save, add, remove, update, clear, and subtotal/item count calculations.",
  "frontend/src/store/CartProvider.tsx": "Provides React context for cart state, syncing with storage and exposing cart manipulation helpers and totals.",
  "frontend/src/utils/authFlowErrorSanitizer.ts": "Converts authentication-related errors into user-friendly messages, removing technical details.",
  "frontend/src/utils/currency.ts": "Formats numbers as INR currency using Intl.NumberFormat.",
  "frontend/src/utils/productImages.ts": "Maps product IDs to image sets and generates URLs using public asset utilities.",
  "frontend/src/utils/publicAssetUrl.ts": "Generates safe public asset URLs that work in local and IC deployments by computing the correct base path.",
  "frontend/src/utils/storefrontErrorSanitizer.ts": "Normalizes storefront browsing errors, mapping IC and backend errors to clearer user-facing messages.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Describes the project’s current state, known issues, architectural notes, and implemented features for build planning."
}