{
  "kind": "build_request",
  "title": "Fix missing product images in storefront and product detail page",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Make product image resolution robust so that the CMF earbuds images render even if the product ID or URL encoding causes mismatches. Specifically: (1) update `ProductImageGallery` to attempt image lookup by `productId` and then fall back to `productName` when no images are found, and (2) update `ProductCard` to resolve the primary image using `product.id` with a fallback to `product.name` if needed.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "i am not able to see the images of the product"
        ]
      },
      "acceptanceCriteria": [
        "On the CMF earbuds product detail page, the gallery shows the real images (not the placeholder) and thumbnails are selectable.",
        "On Shop/Home/Category product cards, the CMF earbuds card shows the primary product image (not the placeholder) when images exist in the mapping.",
        "If a product truly has no mapped images, the existing placeholder behavior remains unchanged."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Ensure image URLs used by the product image mapping are safe to load in the browser when filenames contain spaces (e.g., `cmf 2-1.webp`). Update the product image helper(s) in `frontend/src/utils/productImages.ts` so returned image `src` values are properly URL-encoded (without changing the actual filenames on disk).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "i am not able to see the images of the product"
        ]
      },
      "acceptanceCriteria": [
        "The browser requests image assets with correctly encoded URLs (spaces encoded) and images load successfully for mapped products.",
        "No changes are required to the existing image filenames referenced in the mapping (e.g., `/assets/products/cmf-cc-earbuds/cmf 2-1.webp` remains the source of truth)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` or any other path listed in `frontend.immutablePaths`.",
    "Keep the backend architecture as a single Motoko actor; no backend changes are required for this fix.",
    "Do not change the product image filenames; fix must work with the existing mapped filenames (including spaces)."
  ],
  "nonGoals": [
    "Adding new products or changing product data in the backend.",
    "Introducing backend image serving (images must remain static frontend assets).",
    "Adding any new third-party image/CDN dependencies."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}