{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Storefront stopped-canister (IC0508) error sanitization and friendly retry states",
  "requirements": [
    {
      "id": "REQ-44",
      "summary": "Detect stopped-backend canister replica rejection errors during product browsing queries and present a short, non-technical English error with existing retry behavior.",
      "acceptanceCriteria": [
        "When `getAllProducts()` or `getProductsByCategory()` fails due to a stopped canister, the UI does not display the raw replica error blob to the user.",
        "Instead, the UI shows a concise English message such as: \"The store service is temporarily unavailable. Please try again in a moment.\" (exact wording can vary but must be English and non-technical).",
        "The error state still offers a \"Retry\" action where the page already supports retry (Shop/Category), and the retry triggers a refetch.",
        "Normal errors (non-IC0508) continue to display a helpful message (or existing behavior) and do not get incorrectly mapped to the stopped-canister message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/storefrontErrorSanitizer.ts",
          "operation": "create",
          "description": "Add a centralized error-sanitization utility for public product browsing queries that (1) detects stopped-canister replica rejection signals (e.g., IC0508, reject code 5, message includes \"is stopped\" / \"CallContextManager\") and maps them to a short, user-friendly English message, and (2) sanitizes other replica-style rejection blobs into a generic, non-technical English message without internal codes/IDs."
        },
        {
          "path": "frontend/src/api/shopHooks.ts",
          "operation": "modify",
          "description": "Wrap public product query functions used by Home/Shop/Category (`getAllProducts`, `getProductsByCategory`) to apply the centralized storefront error sanitizer before errors reach the UI, ensuring stopped-canister failures become the friendly temporary-unavailable message and other replica rejection blobs do not surface raw details."
        },
        {
          "path": "frontend/src/pages/ShopPage.tsx",
          "operation": "modify",
          "description": "Replace ad-hoc error message rewriting with the centralized storefront error sanitizer output so Shop page errors never expose raw replica rejection payloads; keep the existing Retry button wired to `refetch()` so it triggers a refetch."
        },
        {
          "path": "frontend/src/pages/CategoryPage.tsx",
          "operation": "modify",
          "description": "Replace ad-hoc error message rewriting with the centralized storefront error sanitizer output so Category page errors never expose raw replica rejection payloads; keep the existing Retry button wired to `refetch()` so it triggers a refetch."
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Sanitize stopped-canister errors for Home page featured products so the Home page never shows raw replica rejection details and other Home sections still render.",
      "acceptanceCriteria": [
        "If the backend canister is stopped, the Home page Featured Products section shows an English \"service temporarily unavailable\" style message (not the raw error).",
        "The rest of the Home page (hero + categories) still renders normally even when product fetching fails.",
        "If the viewer is an admin and the shop is empty, the existing admin initialization empty-state behavior remains unchanged (this requirement only changes the error presentation when a fetch error occurs)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Ensure the Featured Products AsyncState receives a sanitized Error (via the centralized storefront error sanitizer and/or sanitized hook errors) so stopped-canister failures render a friendly English message; preserve existing admin empty-state initialization UI (only affect error presentation, not empty-state behavior)."
        }
      ]
    },
    {
      "id": "REQ-46",
      "summary": "Ensure all user-facing storefront browsing errors are English-only, non-technical, and never leak internal rejection payload details.",
      "acceptanceCriteria": [
        "No UI surface in the public browsing flow (Home/Shop/Category) displays raw backend rejection payloads (request IDs, principals, CBOR arg bytes, headers) to the user.",
        "Any new/updated error messages shown to the user are in English and understandable to non-technical users."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/storefrontErrorSanitizer.ts",
          "operation": "modify",
          "description": "Enforce an English-only, non-technical message policy in the sanitizer: strip/avoid internal codes (IC0508), reject codes, request IDs, principals, CBOR details, and map replica-style rejection blobs to safe generic copy while preserving helpful, user-friendly messages for ordinary non-replica errors."
        },
        {
          "path": "frontend/src/components/feedback/AsyncState.tsx",
          "operation": "modify",
          "description": "Harden the error rendering fallback so public-facing UI does not accidentally display long/raw error blobs; prefer a short generic English fallback when an error message appears overly technical (while still allowing sanitized, user-friendly messages through)."
        }
      ]
    }
  ]
}